function avg (x, y) {
... return (x+y)/2
... }
> avg (6, 7)
6.5


function aveofthree (x, y, z) {
... return (x+y+z)/3
... }

> aveofthree (3, 8, 4)
5

function isodd (x) {
... return (x%2)
... }

> isodd (4)
0
> isodd (7)
1
